tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "universal-ctags/universal-ctags"

# mac app store installer
brew "mas"

brew "clpbar"
brew "elinks"
brew "gdb"
brew "go"
brew "hub", args: ["HEAD"]
brew "imagemagick"
brew "llvm"
brew "mercurial"

brew "pandoc"
brew "perl"
brew "qpdf"
brew "r"
brew "reattach-to-user-namespace"
brew "redis"
brew "ruby"
brew "rustup-init"
brew "sbcl"
brew "subversion"
brew "task"
brew "tbb"
brew "tmux"
brew "tree"
brew "urlview"
brew "vit"
brew "w3m"
brew "watch"
brew "wdiff"
brew "wiggle"
brew "yaml-cpp"

cask "alfred"
cask "bibdesk"
cask "bettertouchtool"
cask "gfxcardstatus"
cask "hammerspoon"
cask "iterm2"
cask "mactex"
cask "mailmate"
cask "marked"
cask "qutebrowser"
cask "skim"
cask "the-unarchiver"
#cask "virtualbox"
#cask "virtualbox-extension-pack"
cask "vnc-viewer"
#cask "caskroom/fonts/font-hack"
cask "font-profont-nerd-font-mono"
cask "font-firacode-nerd-font-mono"

# file utilities
brew "fd"
brew "exa"
brew "ripgrep"
brew "the_platinum_searcher"
brew "the_silver_searcher"
brew "ack"
brew "findutils"
brew "ncdu"

# vpn
brew "ocproxy"
brew "openconnect"

# vim
tap "neovim/neovim"
brew "macvim"
cask "vimr"
brew "neovim"
brew "vimpager"
brew "cscope"
brew "ctags", link: false
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]

# code formatting and highlighting
brew "astyle"
brew "clang-format"
brew "highlight"
brew "source-highlight"
brew "uncrustify"

# email
tap "neomutt/neomutt"
brew "msmtp"
brew "offlineimap"
brew "neomutt/neomutt/neomutt", args: ["with-notmuch-patch"]
brew "notmuch", args: ["with-emacs"]

# build utilities and deps
brew "autoconf"
brew "automake"
brew "scons"
brew "meson", args: ["HEAD"]
brew "ninja"
brew "ccache"
brew "bear"
brew "make"
brew "cmake"

# fundamentals
brew "binutils"
brew "coreutils"
brew "bash"
brew "bash-completion"
brew "wget"
brew "zsh"
brew "git", args: ["without-completions"]
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "gawk"

# process utils
brew "htop"


cask "syncthing"
cask "1password"
cask "google-chrome"



