tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/python'
tap 'homebrew/science'
tap 'homebrew/tex'
tap 'homebrew/versions'
tap 'homebrew/x11'
cask 'java'
brew 'docbook'
brew 'asciidoc'
brew 'astyle'
brew 'xz'
brew 'pkg-config'
brew 'gettext'
brew 'libffi'
brew 'glib'
brew 'pcre'
brew 'git'
brew 'gobject-introspection'
brew 'atk'
brew 'libsigc++'
brew 'glibmm'
brew 'atkmm'
brew 'autoconf'
brew 'automake'
brew 'readline'
brew 'bash'
brew 'bash-completion'
brew 'bdw-gc'
brew 'cmake'
brew 'bear'
brew 'icu4c'
brew 'boost'
brew 'boost-build'
brew 'boost-python'
brew 'go'
brew 'docker'
brew 'boot2docker'
brew 'bsdmake'
brew 'openssl'
brew 'neon'
brew 'cadaver'
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'pixman'
brew 'cairo'
brew 'cairomm'
brew 'mercurial'
brew 'cayley'
brew 'gmp'
brew 'mpfr'
brew 'cgal'
brew 'ninja'
brew 'sqlite', args: ['with-functions']
brew 'scons'
brew 'libgpg-error'
brew 'libgcrypt'
brew 'libksba'
brew 'libassuan'
brew 'pth'
brew 'pinentry'
brew 'gpg-agent'
brew 'gdbm'
brew 'python'
brew 'subversion'
brew 'clang-format'
brew 'clib'
brew 'libsigsegv'
brew 'clisp'
brew 'isl'
brew 'cloog'
brew 'clpbar'
brew 'coreutils'
brew 'cscope'
brew 'ctags'
brew 'curl'
brew 'libsodium'
brew 'zeromq', args: ['with-libsodium']
brew 'czmq'
brew 'dirmngr'
brew 'elinks'
brew 'libtasn1'
brew 'nettle'
brew 'gnutls'
brew 'libtool'
brew 'jpeg'
brew 'libtiff'
brew 'gdk-pixbuf'
brew 'libepoxy'
brew 'intltool'
brew 'gsettings-desktop-schemas'
brew 'harfbuzz'
brew 'pango'
brew 'hicolor-icon-theme'
brew 'gtk+3'
brew 'libcroco'
brew 'librsvg', args: ['with-gtk+3']
brew 'little-cms'
brew 'imagemagick'
brew 'emacs'
brew 'findutils'
brew 'fish'
brew 'flex'
brew 'libmpc'
brew 'gcc'
brew 'gflags'
brew 'global', args: ['with-exuberant-ctags', 'with-pygments', 'with-sqlite3']
brew 'glog'
brew 'gmime'
brew 'gnome-icon-theme'
brew 'gnu-tar'
brew 'libusb'
brew 'libusb-compat'
brew 'gnupg2'
brew 'google-sparsehash'
brew 'gpgme'
brew 'graphviz'
brew 'groovy', args: ['with-invokedynamic']
brew 'gsl'
brew 'gtk+'
brew 'pangomm'
brew 'gtkmm'
brew 'htop-osx'
brew 'hub', args: ['HEAD']
brew 'json-c'
brew 'jsoncpp'
brew 'leptonica'
brew 'libconfig'
brew 'libevent'
brew 'libmagic'
brew 'libyaml'
brew 'llvm', args: ['with-clang', 'with-lld', 'with-lldb', 'with-python', 'HEAD']
brew 'lua'
brew 'macvim', args: ['with-lua', 'with-custom-icons', 'with-override-system-vim']
brew 'maven'
brew 'protobuf', args: ['devel']
brew 'mobile-shell'
brew 'multimarkdown'
brew 'tokyo-cabinet'
brew 's-lang'
brew 'mutt', args: ['with-s-lang']
brew 'mysql'
brew 'neo4j'
brew 'nimrod'
brew 'node'
brew 'xapian'
brew 'talloc'
brew 'notmuch', args: ['with-emacs', 'with-python']
brew 'offline-imap'
brew 'ossp-uuid'
brew 'perl'
brew 'popt'
brew 'postgresql', args: ['with-python']
brew 'proctools'
brew 'protobuf-c'
brew 'pv'
brew 'py2cairo'
brew 'pygobject3'
brew 'qt'
brew 'redis'
brew 'ruby'
brew 'rust'
brew 'sbcl'
brew 'source-highlight'
brew 'sqlitebrowser'
brew 'stash-cli'
brew 'swig'
brew 'task', args: ['with-gnutls']
brew 'tasksh'
brew 'tbb'
brew 'tesseract'
brew 'the_platinum_searcher'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'vimpager'
brew 'vit'
brew 'wdiff'
brew 'wget'
brew 'wiggle'
brew 'caskroom/cask/brew-cask'
brew 'homebrew/python/numpy'
brew 'homebrew/python/matplotlib'
brew 'homebrew/python/scipy'
brew 'homebrew/science/graph-tool'
brew 'homebrew/science/hwloc', args: ['with-cairo']
brew 'homebrew/science/lp_solve'
brew 'homebrew/science/r'
brew 'homebrew/tex/latexdiff'
brew 'homebrew/tex/git-latexdiff'
brew 'homebrew/tex/latex-mk'
brew 'homebrew/versions/gmp4'
brew 'homebrew/versions/ppl011'
brew 'homebrew/versions/cloog-ppl015'
brew 'homebrew/versions/mpfr2'
brew 'homebrew/x11/inkscape'
cask 'bettertouchtool'
cask 'bibdesk'
cask 'cargo'
cask 'eclipse-java'
cask 'emacs'
cask 'gfxcardstatus'
cask 'mailpile'
cask 'mjolnir'
cask 'mysqlworkbench'
cask 'opennx'
cask 'radiant-player'
cask 'the-unarchiver'
cask 'thunderbird'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
