brew "ack"
brew "apr"
brew "apr-util"
brew "asciidoc"
brew "aspell"
brew "astyle"
brew "aterm"
brew "atk"
brew "atkmm"
brew "autoconf"
brew "automake"
brew "bash"
brew "bash-completion"
brew "bdw-gc"
brew "bear"
brew "binutils"
brew "boost"
brew "boost-build"
brew "boost-python"
brew "bsdmake"
brew "cadaver"
brew "cairomm"
brew "cayley"
brew "ccache"
brew "cgal"
brew "check"
brew "cityhash"
brew "clang-format"
brew "clib"
brew "clisp"
brew "cloog"
brew "cloog@0.15"
brew "clpbar"
brew "cmocka"
brew "coreutils"
brew "cscope"
brew "ctags"
brew "czmq"
brew "dirmngr"
brew "docbook"
brew "docbook-xsl"
brew "elinks", args: ["devel"]
brew "emacs"
brew "enchant"
brew "findutils"
brew "fish"
brew "flex"
brew "gawk"
brew "gd"
brew "gdb"
brew "gettext"
brew "gflags"
brew "git", args: ["without-completions"]
brew "glib-networking"
brew "glibmm"
brew "glog"
brew "gmime"
brew "gmp"
brew "gmp@4"
brew "gnome-icon-theme"
brew "gnu-getopt"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "google-sparsehash"
brew "gperftools"
brew "gpg-agent"
brew "gpgme"
brew "graphviz"
brew "groovy", args: ["with-invokedynamic"]
brew "gsl"
brew "gtk+"
brew "gtkmm"
brew "gtkmm3"
brew "hicolor-icon-theme"
brew "highlight"
brew "homebrew/science/graph-tool"
brew "homebrew/science/lp_solve"
brew "htop-osx"
brew "hub", args: ["HEAD"]
brew "hwloc", args: ["with-cairo"]
brew "icu4c"
brew "imagemagick"
brew "intltool"
brew "isl"
brew "isl@0.11"
brew "jansson"
brew "jpeg"
brew "json-c"
brew "jsoncpp"
brew "leptonica"
brew "libassuan"
brew "libconfig"
brew "libevent"
brew "libksba"
brew "libmagic"
brew "libmpc@0.8"
brew "libpgm"
brew "libsigc++"
brew "libsigsegv"
brew "libsoup"
brew "libssh2"
brew "libtool"
brew "libusb-compat"
brew "libyaml"
brew "little-cms"
brew "luajit"
brew "macvim", args: ["with-lua", "with-override-system-vim"]
brew "make", args: ["with-guile@2.0"]
brew "mercurial"
brew "meson"
brew "mobile-shell"
brew "mono"
brew "mpfr"
brew "mpfr@2"
brew "mpich"
brew "multimarkdown"
brew "nanomsg"
brew "neon"
brew "nettle"
brew "ninja"
brew "notmuch", args: ["with-emacs"]
brew "offlineimap"
brew "openssl"
brew "ossp-uuid"
brew "pandoc"
brew "pangomm"
brew "perl"
brew "popt"
brew "ppl@0.11"
brew "proctools"
brew "protobuf-c"
brew "pth"
brew "pv"
brew "py2cairo"
brew "qpdf"
brew "qt"
brew "r"
brew "ripgrep"
brew "rogual/neovim-dot-app/neovim-dot-app"
brew "ruby"
brew "s-lang"
brew "sbcl"
brew "scons"
brew "source-highlight"
brew "subversion"
brew "swig"
brew "syncthing"
brew "syncthing-inotify"
brew "talloc"
brew "task"
brew "tasksh"
brew "tbb"
brew "terminator"
brew "tesseract"
brew "the_platinum_searcher"
brew "the_silver_searcher"
brew "tmux"
brew "tokyo-cabinet"
brew "tree"
brew "uncrustify"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "valgrind"
brew "vimpager"
brew "vit"
brew "wdiff"
brew "wget"
brew "wiggle"
brew "xapian"
brew "xmlto"
brew "yaml-cpp"
brew "zsh"
tap "caskroom/cask"
cask "emacs"
cask "hammerspoon"
cask "alfred"
cask "the-unarchiver"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/boneyard"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/python"
tap "homebrew/science"
tap "homebrew/tex"
tap "homebrew/versions"
tap "homebrew/x11"
tap "neovim/neovim"
tap "rogual/neovim-dot-app"
tap "universal-ctags/universal-ctags"
